balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/18xxxx/PIC18F85J11.PIC
      <edc:DCRDef edc:access="nn---nnn" edc:cname="CONFIG2L" edc:default="0xc7" edc:desc="" edc:impl="0xc7" edc:name="CONFIG2L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xc7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FOSC" edc:desc="Oscillator Selection bits" edc:mask="0x3" edc:name="FOSC" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ECPLL" edc:desc="EC oscillator, PLL enabled and under software control, CLK function on OSC2" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC oscillator, CLKO function on OSC2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="HSPLL" edc:desc="HS oscillator, PLL enabled and under software control" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS oscillator" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FOSC2" edc:desc="Default/Reset System Clock Select bit" edc:mask="0x1" edc:name="FOSC2" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Clock selected by FOSC1:FOSC0 as system clock is enabled when OSCCON&lt;1:0> = 00" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="INTRC enabled as system clock when OSCCON&lt;1:0> = 00" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="FCMEN" edc:desc="Fail-Safe Clock Monitor Enable bit" edc:mask="0x1" edc:name="FCMEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Fail-Safe Clock Monitor disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Fail-Safe Clock Monitor enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Two-Speed Start-up (Internal/External Oscillator Switchover) Control bit" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Two-Speed Start-up disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Two-Speed Start-up enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnn" edc:cname="CONFIG2H" edc:default="0xff" edc:desc="" edc:impl="0xff" edc:name="CONFIG2H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Timer Postscaler Select bits" edc:mask="0xf" edc:name="WDTPS" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="32768" edc:desc="1:32768" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="16384" edc:desc="1:16384" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="8192" edc:desc="1:8192" edc:when="(field &amp; 0xf) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="4096" edc:desc="1:4096" edc:when="(field &amp; 0xf) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="2048" edc:desc="1:2048" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="1024" edc:desc="1:1024" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="512" edc:desc="1:512" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="256" edc:desc="1:256" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="128" edc:desc="1:128" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="64" edc:desc="1:64" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="32" edc:desc="1:32" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="16" edc:desc="1:16" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="8" edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="4" edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="2" edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="1" edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="RESERVED" edc:ishidden="true" edc:mask="0xf" edc:name="RESERVED" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:desc="RESERVED" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnn---" edc:cname="CONFIG3L" edc:default="0xf8" edc:desc="" edc:impl="0xf8" edc:name="CONFIG3L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf8">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="3"/>
            <edc:DCRFieldDef edc:cname="EASHFT" edc:desc="External Address Bus Shift Enable bit" edc:mask="0x1" edc:name="EASHFT" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Address shifting enabled, address on external bus is offset to start at 000000h" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Address shifting disabled, address on external bus reflects the PC value" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MODE" edc:desc="External Memory Bus" edc:mask="0x3" edc:name="MODE" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="MM" edc:desc="Microcontroller mode - External bus disabled" edc:memmodeidref="microctrl" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="XM12" edc:desc="Extended Microcontroller mode, 12-bit Address mode" edc:memmodeidref="extmicroctrl12bit" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XM16" edc:desc="Extended Microcontroller mode, 16-bit Address mode" edc:memmodeidref="extmicroctrl16bit" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="XM20" edc:desc="Extended Microcontroller mode, 20-bit Address mode" edc:memmodeidref="extmicroctrl20bit" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BW" edc:desc="Data Bus Width Select bit" edc:mask="0x1" edc:name="BW" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="16" edc:desc="16-bit external bus mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="8" edc:desc="8-bit external bus mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WAIT" edc:desc="External Bus Wait Enable bit" edc:mask="0x1" edc:name="WAIT" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Wait states for operations on external memory bus disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Wait states for operations on external memory bus enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
